function [xr, yr, zr,xl, yl, zl, T] = ztmkinematics(l1, l2, l3, l4, l5, l6,q)
%% ZTMJACOBIAN 函数摘要
%  2024.4.22创建 by worromot
%  10自由度双足运动学建模,计算出相对于身体中心点的坐标
%  说明：q中参数分别对应0、1、2---10号关节角度
%        T为左右脚指尖位置
%        xl, yl, zl, xr, yr, zr内分别为1~10关节坐标
%        注意，该建模包含腰部关节，即0号关节


%% 调试用临时参数：
 % l1=90; l2=0; l3=100; l4=370; l5=310; l6=100;
 % q_0 = pi/2;%0;
% 
% ql = [ 4.5*pi/180; -pi/10;  6*pi/180;  0; -65.5*pi/180;];
% qr = [-4.5*pi/180;  pi/10; -6*pi/180; pi; -65.5*pi/180;];

% qr = [ 0;  0;  0;  0;  0;];%1; 2; 3; 4; 5（关节号）; 
% ql = [ 0;  0;  pi/2;  -pi/2;  0;];%6; 7; 8; 9; 10;


% q=[q_0;qr;ql];

%% 三角函数求解
  allsin=sin(q);
% 腰部
    s0=allsin(1);
% 右腿
    s1= allsin(2);%1号关节
    s2= allsin(3);
    s3= allsin(4);
    s4= allsin(5); 
    s5= allsin(6);
% 左腿
    s6= allsin(7);%6号关节
    s7= allsin(8);
    s8= allsin(9);
    s9= allsin(10);
    s10=allsin(11);

 allcos=cos(q);
% 腰部
    c0= allcos(1);
% 右腿
    c1= allcos(2);
    c2= allcos(3);
    c3= allcos(4);
    c4= allcos(5);
    c5= allcos(6);
 % 左腿
    c6= allcos(7);
    c7= allcos(8);   
    c8= allcos(9);
    c9= allcos(10);
    c10=allcos(11);


%% 变换矩阵
%腰部--------------------------------------------------------- 
Tbase_to_0=[ c0,  -s0,   0,   0;...
		     s0,   c0,   0,   0;...
		      0,    0,   1,   0;...
		      0,    0,   0,   1];
%右腿--------------------------------------------------------- 
     T01=[  1,    0,   0,    0;...  %Rx
		    0,   c1, -s1,  -l1;...
		    0,   s1,  c1,    0;...
		    0,    0,   0,   1];

     T12=[   c2,  -s2,   0,  l2;... %Rz
		     s2,   c2,   0,   0;...
		      0,    0,   1,   0;...
		      0,    0,   0,   1];
         
         
      T23=[c3,    0,  s3,   0;... %Ry
		    0,    1,   0,   0;...
		  -s3,    0,  c3, -l3;...
		    0,    0,   0,   1];    
              

              
      T34=[c4,   0,  s4,   0;... %Ry
		    0,   1,   0,   0;...
		  -s4,   0,  c4, -l4;...
		    0,   0,   0,   1];  
           
            
      T45=[c5,   0,  s5,   0;... %Ry
		    0,   1,   0,   0;...
		  -s5,   0,  c5, -l5;...
		    0,   0,   0,   1];  
                                     
       toe_p=[l6; 0; 0; 1];
%左腿--------------------------------------------------------- 
     T06=[  1,    0,   0,   0;...
		    0,   c6, -s6,  l1;...
		    0,   s6,  c6,   0;...
		    0,    0,   0,   1];

     T67=[   c7,  -s7,   0,  l2;... %Rz
		     s7,   c7,   0,   0;...
		      0,    0,   1,   0;...
		      0,    0,   0,   1];
                  
      T78=[c8,    0,  s8,   0;...
		    0,    1,   0,   0;...
		  -s8,    0,  c8, -l3;...
		    0,    0,   0,   1];    
              
              
      T89=[c9,   0,  s9,   0;...
		    0,   1,   0,   0;...
		  -s9,   0,  c9, -l4;...
		    0,   0,   0,   1];          
            
      T9_10=[c10,  0,  s10,   0;...
		      0,   1,   0,    0;...
		    -s10,  0,  c10, -l5;...
		      0,   0,   0,   1];  

%% 求解每个关节坐标

%右腿---------------------------------------------------------   
    xr = 0; yr = 0; zr = 0;

    T_r=Tbase_to_0*T01;
	xr=[xr;T_r(1,4)]; %x=[0;T01(1,4)] Each joint has been given.
	yr=[yr;T_r(2,4)]; %y=[0;T01(2,4)]
	zr=[zr;T_r(3,4)]; %z=[0;T01(3,4)]
    
	T_r=T_r*T12;
	xr=[xr;T_r(1,4)]; %x=[0;T01(1,4);T12(1,4)]
	yr=[yr;T_r(2,4)]; %y=[0;T01(2,4);T12(2,4)]
	zr=[zr;T_r(3,4)]; %z=[0;T01(3,4);T12(3,4)]
    
	T_r=T_r*T23;
	xr=[xr;T_r(1,4)];
	yr=[yr;T_r(2,4)];
	zr=[zr;T_r(3,4)];

	T_r=T_r*T34;
	xr=[xr;T_r(1,4)];
	yr=[yr;T_r(2,4)];
	zr=[zr;T_r(3,4)];


    T_r=T_r*T45;
	xr=[xr;T_r(1,4)];
	yr=[yr;T_r(2,4)];
	zr=[zr;T_r(3,4)];

    T_r=T_r*toe_p;
    
    xr=[xr;T_r(1)];
	yr=[yr;T_r(2)];
	zr=[zr;T_r(3)];   

%左腿--------------------------------------------------------- 
xl = 0; yl = 0; zl = 0;

 T_l=Tbase_to_0*T06;
	xl=[xl;T_l(1,4)]; %x=[0;T01(1,4)] Each joint has been given.
	yl=[yl;T_l(2,4)]; %y=[0;T01(2,4)]
	zl=[zl;T_l(3,4)]; %z=[0;T01(3,4)]
    
 T_l=T_l*T67;
	xl=[xl;T_l(1,4)]; %x=[0;T01(1,4);T12(1,4)]
	yl=[yl;T_l(2,4)]; %y=[0;T01(2,4);T12(2,4)]
	zl=[zl;T_l(3,4)]; %z=[0;T01(3,4);T12(3,4)]
    
 T_l=T_l*T78;
	xl=[xl;T_l(1,4)];
	yl=[yl;T_l(2,4)];
	zl=[zl;T_l(3,4)];

 T_l=T_l*T89;
	xl=[xl;T_l(1,4)];
	yl=[yl;T_l(2,4)];
	zl=[zl;T_l(3,4)];


 T_l=T_l*T9_10;
	xl=[xl;T_l(1,4)];
	yl=[yl;T_l(2,4)];
	zl=[zl;T_l(3,4)];

 T_l=T_l*toe_p;
    
    xl=[xl;T_l(1)];
	yl=[yl;T_l(2)];
	zl=[zl;T_l(3)];

  T=[T_r;T_l];
end

